CSI API ETABS v1
cTendonObj.GetDatumOffset Method
 Retrieves the datum offset - intended for internal use
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDatumOffset(
	string Name,
	ref int NumberItems,
	ref string[] TendonName,
	ref double[] DatumOffset,
	eItemType ItemType = eItemType.Objects
)
Function GetDatumOffset (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef TendonName As String(),
	ByRef DatumOffset As Double(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cTendonObj
Dim Name As String
Dim NumberItems As Integer
Dim TendonName As String()
Dim DatumOffset As Double()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetDatumOffset(Name,
	NumberItems, TendonName, DatumOffset,
	ItemType)
int GetDatumOffset(
	String^ Name,
	int% NumberItems,
	array<String^>^% TendonName,
	array<double>^% DatumOffset,
	eItemType ItemType = eItemType::Objects
)
abstract GetDatumOffset :
        Name : string *
        NumberItems : int byref *
        TendonName : string[] byref *
        DatumOffset : float[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing tendon object or group, depending on the value of the ItemType item.
NumberItems
Type: System.Int32
 The total number of items retrieved for the specified tendon objects, all the retrieved data arrays are dimensioned to this length
TendonName
Type: System.String[]
 The name of the tendon object associated with each value.
DatumOffset
Type: System.Double[]
 Global Z dist from model datum to tendon layout datum, positive in positive global Z direction [L]
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, data is retrieved for the tendon object specified by the Name item.
 If this item is Group, data is retrieved for all tendon objects in the group specified by the Name item.
 If this item is SelectedObjects, data is retrieved for all selected tendon objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
 This function is intended for internal use
See Also
Reference
cTendonObj Interface
ETABSv1 Namespace